[
    {
        "id": "A_1",
        "section": "A",
        "details": "Jeg f칮ler mig stresset. Det lyder ikke rart 游. Der kan v칝re mange 친rsager til, at man f칮ler sig stresset. P친 AAU skal du selv s칮rge for at strukturere og prioritere din tid, og n친r planl칝gningen halter, s친 kan det godt resultere i, at du f칮ler dig b친de presset og stresset. Du kan l칝se mere om og f친 redskaber til det her: https://www.studerende.aau.dk/studieliv/studieteknik/find-din-studierytme. Hvis du gerne vil tale med en vejleder om din stress, s친 l칝s mere om dine muligheder her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_2",
        "section": "A",
        "details": "Hvordan f친r jeg tid til alt? P친 AAU er du ansvarlig for at strukturere din tid -- og det kan v칝re nemmere sagt end gjort. Men et godt sted at starte kan v칝re ved at danne dig et overblik over alle dine g칮rem친l. Du kan finde redskaber til tidsstyring og prioritering her: https://www.studerende.aau.dk/studieliv/studieteknik/find-din-studierytme#b690e77c-99fe-43a7-aca4-868e98bc7d38. Hvis du gerne vil tale med en vejleder om tidsstyring, s친 l칝s mere her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_3",
        "section": "A",
        "details": "Hvordan forbereder jeg til min eksamen? Der er mange m친der at forberede sig p친, men det kan godt tage tid og afpr칮vning, f칮r du finder frem til den m친de, der fungerer bedst for dig. Du kan finde inspiration til din eksamensforberedelse her: https://www.studerende.aau.dk/studieliv/studieteknik/eksamensforberedelse. Hvis du gerne vil tale om eksamensforberedelse med en vejleder, l칝s mere her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_4",
        "section": "A",
        "details": "Hvorfor er jeg ikke motiveret? Motivation kan svinge meget og er p친virket af pres, stress, studietvivl, og andre faktorer. Du kan finde 칮velser og redskaber til motivation her: https://www.studerende.aau.dk/studieliv/studieteknik/motivation-og-studietvivl/motivation-og-mindset. Du kan ogs친 tale med en vejleder om din motivation. L칝s mere her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_5",
        "section": "A",
        "details": "Hvorfor kan jeg ikke tage mig sammen? Hvis du har sv칝rt ved at komme i gang, kan det skyldes lav motivation. Du kan finde redskaber til at arbejde med motivation og mindset her: https://www.studerende.aau.dk/studieliv/studieteknik/motivation-og-studietvivl/motivation-og-mindset. Hvis du hellere vil tale med en vejleder, kan du booke en samtale her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_6",
        "section": "A",
        "details": "Mistrivsel i gruppe: Hvad skal vi g칮re, n친r vi ikke kan enes? Uenigheder og konflikter er sv칝re at undg친. Du kan finde inspiration til gruppearbejde og h친ndtering af konflikter her: https://www.studerende.aau.dk/studieliv/studieteknik/inspiration-til-dit-gruppearbejde#konflikth친ndtering-og-hj칝lpemuligheder. Hvis det er konfliktoptrappende, kan I f친 hj칝lp fra en vejleder. L칝s mere her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_7",
        "section": "A",
        "details": "Min gruppe og jeg er i konflikt. Hvad skal vi g칮re? Konflikter kan sj칝ldent l칮ses ved at undg친 dem. I kan f친 hj칝lp til at facilitere en samtale gennem en vejleder. L칝s mere om, hvordan I booker hj칝lp her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_8",
        "section": "A",
        "details": "Jeg tror jeg skal sygemeldes fra studiet, hvordan fungerer det? At blive sygemeldt betyder, at du kan f친 en tidsbestemt pause fra studiet pga. helbredsm칝ssige 친rsager. L칝s mere om sygemelding her: https://www.studerende.aau.dk/regler/orlov-sygemelding-og-barsel.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_9",
        "section": "A",
        "details": "Hvad er forskellen p친 en sygemelding og en orlov? Som sygemeldt kan du stadig f친 SU og v칝re studieaktiv, hvilket ikke er muligt p친 en orlov. L칝s mere her: https://www.studerende.aau.dk/regler/orlov-sygemelding-og-barsel.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_10",
        "section": "A",
        "details": "Hvem skal jeg informere, hvis jeg 칮nsker at s칮ge sygemelding? Informer b친de din studiesekret칝r og studien칝vnssekret칝r. Det er ogs친 en god id칠 at tale med din studievejleder om, hvordan du kommer i gang igen efter din sygemelding. L칝s mere her: https://www.studerende.aau.dk/vejledning/studie-trivselsvejledning.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_11",
        "section": "A",
        "details": "Hvordan bliver jeg udmeldt fra AAU? Du kan selv udmelde dig via STADS Selvbetjening. L칝s mere her: https://www.studerende.aau.dk/regler/udmeldelse-af-studie.",
        "source": "AAU Questions",
        "student_id": "global"
    },
    {
        "id": "A_12",
        "section": "A",
        "details": "Jeg har det ikke godt og f칮ler mig presset og stresset. Der er flere ting, du kan g칮re for at nedbringe dit stressniveau, fx mindfulness, faste studievaner, og sociale aktiviteter. L칝s mere om st칮ttetilbud her: https://www.studerende.aau.dk/studieliv/trivsels-og-stottetilbud-til-dig.",
        "source": "AAU Questions",
        "student_id": "global"
    }
]
