[
    {
        "course_name": "Machine Intelligence",
        "details": "Specialization in Machine Intelligence / Specialiseringskursus i maskinintelligens (spMI), 5 ECTS Module description. Module coordinator Manfred Jaeger jaeger@cs.aau.dk, Kim Guldstrand Larsen kgl@cs.aau.dk, Martin Kristjansen mk@cs.aau.dk, Tomer Sagi tsagi@cs.aau.dk, Thomas Dyhre Nielsen tdn@cs.aau.dk, Christian S. Jensen csj@cs.aau.dk, Anders Læsø Madsen alm@cs.aau.dk, Daniele Dell'Aglio dade@cs.aau.dk, Alvaro Torralba alto@cs.aau.dk Type and language Course held in English Objectives As described in the study regulations Academic content and conjunction with other modules/semesters   Scope and expected performance It should be stressed that AAU expects each student to spend 30 hours of study per ECTS credit, amounting to 150 hours Participants DAT9, AAL-SW9, CS-IT9 Preprequisites for participation   Module activities (course sessions etc.) The course consists of seminar-style sessions in small groups of students. A seminar session mostly consists of student presentations and discussions of scientific research articles. Course teachers may supplement the student driven activities with lectures and presentations. Examination Oral examination The students will get 7 days before the exam an article that they should read, understand and present during the examination. The presentation should take 30 minutes, followed by about 10 minute discussion with the examiner and the censor, after which the grade will be given.",
        "source": "https://www.moodle.aau.dk/mod/page/view.php?id=1755016",
        "id": "id1"
    },
    {
        "course_name": "Web Intelligence",
        "details": "Module title and ECTS credits: Web Intelligence (WI), 5 ECTS. Module coordinator: Manfred Jaeger (jaeger@cs.aau.dk). Type and language: Course conducted in English, with all course materials available for download in the 'Resource folder' for each lecture. Objectives: The course explores the rapid growth of digital information on the web, focusing on the application of machine intelligence. It covers theories and techniques from information retrieval, network science, and machine learning. Although centered on the 'web', the techniques taught are broadly applicable to network-structured data, including social networks, e-commerce customer-product networks, and citation networks. Core topics include information retrieval, search, and ranking; social network analytics; information diffusion on networks; neural network approaches for network prediction; and recommender systems. Academic content and conjunction with other modules/semesters: The course is designed to cover 5 ECTS credits, totaling 150 hours of study as expected by AAU. Scope and expected performance: The course consists of 11 lectures, each lasting two hours, with two-hour exercise sessions preceding each lecture. Additionally, weekly four-hour self-study slots are designated for larger assignments involving implementation and experimentation with techniques from the lectures. Participants: SW7. Prerequisites for participation: None. Module activities: The course includes lectures, exercises, and self-study assignments. Examination: Oral examination based on course materials and self-studies.",
        "source": "https://www.moodle.aau.dk/mod/page/view.php?id=1412554",
        "id": "id2"
    },
    {
        "course_name": "Imperative Programming",
        "details": "Module title (ENG/DK) and ECTS credits: Imperative Programming / Imperativ programmering (IMPR), 5 ECTS. Module coordinator: Anders Schlichtkrull (andsch@cs.aau.dk). Type and language: Course and readings in Danish. Objectives: The course aims for students to gain insight into basic concepts such as algorithms, data structures, and computer architectures. Knowledge includes development environment and compilation, imperative principles, data types and variables, control structures, functions and procedures, data structures (including arrays), input/output, composite data structures, simple algorithms (e.g., sorting and searching), and basic testing of programs. Skills include writing, running, and testing programs that incorporate these basic concepts and using correct subject terminology. Competences involve implementing an imperative program independently and collaboratively as a solution to a defined task. Academic content and conjunction with other modules/semesters: The course is closely related to the P1 project, with connections to the DTG course. Scope and expected performance: AAU expects each student to spend 30 hours of study per ECTS credit, totaling 150 hours. Participants: CPH-SW1, CCT1. Prerequisites for participation: None, as the course is in the 1st semester. Module activities: The course consists of 14 lessons where programming is demonstrated live. Weekly preparation includes watching videos and reading textbook chapters. Lessons address current issues, with programming assignments mainly done in groups, promoting joint development and discussion. Several lessons offer individual assignments with feedback from assistant teachers. Breakdown of hours: 14 auditorium lessons (approx. 28 hours), 13 group assignments (approx. 25 hours), individual preparation (approx. 64 hours: 14 hours for videos, 20 hours for readings, 30 hours for assignments), and approx. 7-10 hours for exam preparation. Examination: Written or oral; final format and permitted aids will be posted on the course page.",
        "source": "https://www.moodle.aau.dk/course/view.php?id=52854",
        "id": "id3"
    },
    {
        "course_name": "Problem-Based Learning",
        "details": "Problembaseret læring (PBL) FYS1, FYSTEK1, GBE1, MP1, MAT1, MATTEK1, MATØK1 E24. Blocks. Main course page. Meddelelser fra undervisere og studiesekretærer. Velkommen til kurset Problembaseret læring (PBL) for MAT1, FYS1, MP1 og GBE1. Kursusansvarlige: Niels Erik Ruan Lyngdorf (nel@plan.aau.dk) og Poul Thøis Madsen (pmadsen@plan.aau.dk). Andre kursusholdere: Bettina Dahl Søndergaard (bdahls@plan.aau.dk), Alberte Rørbæk Kokholm Sørensen (arks@plan.aau.dk), og Mia Thyrre (mthy@plan.aau.dk). Konsulenter på statusseminarer og gruppearbejde: Mia Thyrre (mthy@plan.aau.dk), Jonna Langeland Christensen (jonna@kreativitetsakademiet.dk), Chrisstin Annet Grunwald (grunwald@plan.aau.dk). Beskrivelse: Målet med kurset er, at de studerende opnår kompetencer til at arbejde problembaseret, planlægge, og organisere projekter samt være refleksive i forhold til egen læring i et gruppebaseret projektarbejde. Der tages udgangspunkt i principperne for problembaseret læring på AAU. Se detaljer om kursets læringsmål i studieordningen (LINK). Kompetencerne, der opnås igennem dette kursus, vil igennem øvelser og konsultation blive knyttet til semestrets projektarbejde. Projektarbejdet er således at betragte som et laboratorium for opbygning af kompetencer, som skal danne grundlag for det problembaserede projektarbejde i resten af studietiden. Derfor arbejdes der løbende og målrettet med en PBL-rapport (ikke at forveksle med PBL-bogen, som jf. nedenfor er jeres lærebog), som i sidste ende, sammen med projektrapporten danner et eksemplarisk og erfaringsbaseret grundlag for fremtidig problembaseret projektarbejde. I PBL-kurset vil eksamen kun tage udgangspunkt i PBL-rapporten og ikke projektrapporten. I får skriftlig og mundtlig feedback på PBL-rapporten løbende, og den kommer til at danne baggrund for eksamen, som er en mundtlig gruppeeksamen, bestået/ikke-bestået. Struktur og kursuselementer: Kurset består af et mix af forelæsninger, øvelser i grupper, skriftlige afleveringer med tilknyttede feedback sessioner i grupper og selvstudie. Derudover vil der blive lagt vægt på, at de studerende formidler den viden, som de tilegner sig. I forbindelse med nogle kursusgange skal I i projektgrupperne udarbejde en skriftlig opgave, som I vil få en kort mundtlig feedback på i grupperne (benævnt som 'Konsultation' i skemaet). Opgaverne vil typisk fungere som input til jeres projekt og PBL-rapport. Modellen nedenfor illustrerer den grundstruktur, som vi kommer til at arbejde efter. Litteratur: Obligatorisk litteratur, der skal anskaffes før kursusstart: 'PBL – Problembaseret læring og projektarbejde ved de videregående uddannelser.' Jette Egelund Holgaard, Thomas Ryberg, Nikolaj Stegeager, Diana Stentoft og Anja Overgaard Thomassen (2020). Samfundslitteratur, 2.Ed. , 186 pp. ISBN 9788759333969. Kaldes til daglig blot PBL-bogen. FACTUM Books - Billige studiebøger - Globale forretningssystemer. FACTUM Books - Billige studiebøger - Mekanik og Produktion. FACTUM Books - Billige studiebøger - FYSIK. FACTUM Books - Billige studiebøger - FYSTEK. FACTUM Books - Billige studiebøger - MAT. FACTUM Books - Billige studiebøger - MATØK. FACTUM Books - Billige studiebøger - MATTEK. Desuden vil der komme yderligere litteratur til de enkelte kursusgange. Det kan I finde under den pågældende kursusgang, eller der vil ligge henvisninger/links, så I selv kan downloade. Slides fra kursusgangene indgår ligeledes i pensum til eksamen. IT: Dele af dette kursus kan blive afholdt online vha. Microsoft Teams (en del af Microsoft 365 pakken), som I har gratis adgang til som studerende ved AAU. Derfor er en del af forberedelsen at installere og sætte jer ind i dette software. I kan finde Microsoft Teams på følgende link: Office365 - Aalborg Universitet (aau.dk).",
        "source": "https://www.moodle.aau.dk/course/view.php?id=51728",
        "id": "id4"
    }
]
